# 연습문제 1
(1) 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.

In [5]:
import pandas as pd
a = pd.Series([1, 2, 3, 4, 5, 6,], index= ['서울', '과천', '성남', '안양', '인천', '부산'])
b = pd.Series([11, 12, 13, 14, 15, 16], index= ['서울', '대구', '포항', '부산', '창원', '안동'])
a, b

(서울    1
 과천    2
 성남    3
 안양    4
 인천    5
 부산    6
 dtype: int64,
 서울    11
 대구    12
 포항    13
 부산    14
 창원    15
 안동    16
 dtype: int64)

(2) 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.

In [9]:
a + b, a - b, a * b, a / b

(과천     NaN
 대구     NaN
 부산    20.0
 서울    12.0
 성남     NaN
 안동     NaN
 안양     NaN
 인천     NaN
 창원     NaN
 포항     NaN
 dtype: float64,
 과천     NaN
 대구     NaN
 부산    -8.0
 서울   -10.0
 성남     NaN
 안동     NaN
 안양     NaN
 인천     NaN
 창원     NaN
 포항     NaN
 dtype: float64,
 과천     NaN
 대구     NaN
 부산    84.0
 서울    11.0
 성남     NaN
 안동     NaN
 안양     NaN
 인천     NaN
 창원     NaN
 포항     NaN
 dtype: float64,
 과천         NaN
 대구         NaN
 부산    0.428571
 서울    0.090909
 성남         NaN
 안동         NaN
 안양         NaN
 인천         NaN
 창원         NaN
 포항         NaN
 dtype: float64)

# 연습문제 2

다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.

(1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.

(2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [30]:
import pandas as pd
data = {
    '마포구' : [1000, 2000, 3000, 4000, 5000],
    '은평구' : [1050, 2050, 3050, 4050, 5050],
    '강남구' : [2030, 3040, 5060, 7080, 8090],
    '중랑구' : [1120, 1130, 1140, 1150, 1160],
    '권역' : ['마포', '은평', '강남', '중랑', '중구'],
    '좌표' : [5.12, 9.08, 11.12, 13.19, 10.28]
}
col = ['권역', '마포구', '은평구', '강남구', '중랑구', '좌표']
ind = ['서울특별시', '광주광역시', '세종특별시', '부산광역시', '제주도' ]
df = pd.DataFrame(data, index=ind, columns=col)
df

       권역   마포구   은평구   강남구   중랑구     좌표
서울특별시  마포  1000  1050  2030  1120   5.12
광주광역시  은평  2000  2050  3040  1130   9.08
세종특별시  강남  3000  3050  5060  1140  11.12
부산광역시  중랑  4000  4050  7080  1150  13.19
제주도    중구  5000  5050  8090  1160  10.28

# 연습문제 3

In [32]:
#다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

(1) 모든 학생의 수학 점수를 시리즈로 나타낸다.

In [34]:
df['영어']

춘향    90
몽룡    70
향단    60
방자    40
Name: 영어, dtype: int64

(2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.

In [36]:
df[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

(3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

In [41]:
df['각 과목 평균 점수'] = ((df['영어'] + df['국어'] + df['수학']) / 3).round(2)
df

    국어  영어  수학  각 과목 평균 점수
춘향  80  90  90       86.67
몽룡  90  70  60       73.33
향단  70  60  80       70.00
방자  30  40  70       46.67

(4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.

In [75]:
del df[3]
df['영어'][3] = 80
df['각 과목 평균 점수'] = ((df['영어'] + df['국어'] + df['수학']) / 3).round(2)
df

<ipython-input-75-88a2586650e8>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['영어'][3] = 80

    국어  영어  수학  각 과목 평균 점수
춘향  80  90  90       86.67
몽룡  90  90  60       80.00
향단  70  90  80       80.00
방자  30  80  70       60.00

(5) 춘향의 점수를 데이터프레임으로 나타낸다.

In [78]:
df[:1]

    국어  영어  수학  각 과목 평균 점수
춘향  80  90  90       86.67

(6) 향단의 점수를 시리즈로 나타낸다.

In [85]:
df.loc['향단']

국어            70.0
영어            90.0
수학            80.0
각 과목 평균 점수    80.0
Name: 향단, dtype: float64

# 연습문제 4

1. 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.

2. 10가지 이상의 방법으로 특정한 행과 열을 선택한다.

In [90]:
import numpy as np
df = pd.DataFrame(np.arange(1, 26).reshape(5, 5), index = ['a', 'b', 'c', 'd', 'e'], columns = [0, 1, 2, 3, 4])
df

    0   1   2   3   4
a   1   2   3   4   5
b   6   7   8   9  10
c  11  12  13  14  15
d  16  17  18  19  20
e  21  22  23  24  25

In [96]:
df.loc[['a']]

   0  1  2  3  4
a  1  2  3  4  5

In [97]:
df.loc['a']

0    1
1    2
2    3
3    4
4    5
Name: a, dtype: int32

In [101]:
df.loc['a':'c']

    0   1   2   3   4
a   1   2   3   4   5
b   6   7   8   9  10
c  11  12  13  14  15

In [102]:
df['b':'e']

    0   1   2   3   4
b   6   7   8   9  10
c  11  12  13  14  15
d  16  17  18  19  20
e  21  22  23  24  25

In [105]:
df.loc[["b", "e"]]

    0   1   2   3   4
b   6   7   8   9  10
e  21  22  23  24  25

In [106]:
df[2]

a     3
b     8
c    13
d    18
e    23
Name: 2, dtype: int32

In [108]:
df[2]['a']

3

In [115]:
df.loc['a', 1]

2

In [116]:
df

    0   1   2   3   4
a   1   2   3   4   5
b   6   7   8   9  10
c  11  12  13  14  15
d  16  17  18  19  20
e  21  22  23  24  25

In [117]:
df.iloc[2,0]

11

In [118]:
df.iloc[:,2:]

    2   3   4
a   3   4   5
b   8   9  10
c  13  14  15
d  18  19  20
e  23  24  25

In [120]:
df.iloc[[-1]]

    0   1   2   3   4
e  21  22  23  24  25

In [121]:
df.iloc[-1]

0    21
1    22
2    23
3    24
4    25
Name: e, dtype: int32

# 연습문제 5

타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.

In [123]:
import seaborn as sns
titanic = sns.load_dataset("titanic")

In [124]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

sort_values 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

In [130]:
titanic[['sex', 'age', 'class', 'alive']].value_counts().sort_values()

sex     age   class   alive
female  14.0  Third   yes       1
male    48.0  Second  no        1
female  11.0  Third   no        1
        13.0  Second  yes       1
male    47.0  Second  no        1
                               ..
        20.0  Third   no       10
        28.0  Third   no       10
        19.0  Third   no       11
        21.0  Third   no       12
        22.0  Third   no       13
Length: 339, dtype: int64

타이타닉호 승객의 평균 나이를 구하라.

In [141]:
titanic['age'].mean(axis=0)

29.69911764705882

타이타닉호 승객중 여성 승객의 평균 나이를 구하라.

In [145]:
a = titanic[['sex' == 'female']]

ValueError: Item wrong length 1 instead of 891.

타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.